{
  "functions": {
    "Phase.add_response()": "'This adds a response row to your data without ending the current trial. This can be useful if you have a specific task in which you need participants to make multiple responses within each trial. For example, I could write something like:<pre>Phase.add_response({<br>   variable_name_1: “store me”,<br>   variable_name_2: “also store me”<br>\\});'",
    "Phase.get()": "'This is used in conjunction with the <em>Phase.set()</em> function as it allows you to retrieve a variable previously stored. For example, if in a previous trial we stored \\'Welcome to the study\\' in the variable <em>hi_message</em> using <em>Phase.set()</em> we can now re-access and store it to a variable via:<pre> var retrieved_hi_message = Phase.get(hi_message);</pre>'",
    "Phase.get_proc()": "'<b>Advanced function</b> - this allows you to import a procedure sheet as a javascript object. From there you can index specific values if needed. This can be used to allow you to reference notes and text as you would using {{variable}} but from rows that are not currently loaded. Note: you need to specify the procedure sheet including the .csv extension in quotes. For example <pre>holdingVar = Phase.get_proc(\\'myProcedure.csv\\')<br>requiredRow = Object.values(holdingVar)[rownum]<br>requiredCol = Object.values(requiredRow)[colnum]</pre>Remember: JavaScript counting starts at 0'",
    "Phase.get_stim()": "'<b>Advanced function</b> - this allows you to import a stimuli sheet as a javascript object. From there you can index specific values if needed. This can be used to allow you to reference specific stimuli as if you used {{variable}} which cannot by standard access this data. Note: you need to specify the stimuli sheet with the .csv extension in quotes. For example <pre>holdingVar = Phase.get_stim(\\'myStimuli.csv\\')<br>requiredRow = Object.values(holdingVar)[rownum]<br>requiredCol = Object.values(requiredRow)[colnum]</pre>Remember: JavaScript counting starts at 0'",
    "Phase.go_to()": "'This will take the participant to the specified row in the associated procedure sheet when the trial ends, rather than the next sequential row. This can be useful for altering task completion based on prior task performance. The procedure row numbers are given on the \\'Projects\\' page in the first, grey column. Experimental trials begin at row 2. For example, if a participant was completing the trial on row 3, and I wished them to go to the trial on row 5 rather than the task on row 4 when they finish, I would replace Phase.submit() with:<pre>Phase.go_to(5);</pre>'",
    "Phase.set()": "'Sometimes you will want to store a variable in one trial, but retrieve it in another. Arguably the easiest way to do this is just to store the variable outside the trial by storing it in the parent space. You can do this by adding <em>\\'parent.parent.\\'</em> before any variable that you want to store for future trials e.g:<pre>parent.parent.hi_message = \\'hi there\\'</pre>However, if you don\\'t want to do this, Collector allows you to store variables using <em>Phase.set(variable_name,variable_content)</em>. <em>Variable_name</em> is what you want to call the variable, and <em>variable_content</em> is what is stored. For example:<br><pre>Phase.set(\\'hi_message\\',{hi: \\'there\\'});</pre>'",
    "Phase.set_timer()":"'Delays code running for a set period (in milliseconds) after a Phase begins.This is because Phases are preloaded in the background (buffered),and so <em>setTimeout()</em> would be triggered from when the Phase is buffered, not when it is displayed.<br><br>Phase.set_timer() requires two inputs, a function and the time until it should be triggered. For example: <pre>Phase.set_timer(function(){ <br> alert(\\'hi\\') <br>},5000);</pre>'",
    "Phase.submit()": "'This ends the trial and moves onto the next one. If you use Phase.go_to(), you do not need to use Phase.submit(). <br><br>It is possible to embed variables within the call which can be useful for updating global space variables. For example: <pre>Phase.submit(parent.parent.myVariable + 1);</pre>'",
    "Development": "'If you are using the {{variable}} call to dynamically load information stored within the procedure spreadsheet it can be useful to add \\'dummy\\' data that will display when previewing the code. To do this, add \\'---development---\\' within an HTML comment above and below an array of variables containing your development values at the start of your code, for example:<pre><xmp style=\\'margin: 0!important;\\'><!--</xmp>---development---<br>[<br>{\\'text\\':\\'your practice text\\'}<br>]<br>---development---<br>--></pre>'"
  },
  "choose_function":{
    "choose_function":"'Please choose a specific function by clicking on the dropdown menu labeled 'Functions' above. This will replace this text with specific help and examples relating to that function.'"
  }
}
  

